app/views/recipes/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
    <h2 class="text-center"><%= @recipe.name %></h2>
    <p> Gemaakt door <%= @recipe.user.first_name %></p>

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1  [["recipe_id", 37]]
---
          <div class="ingredient-info text-left">
            <% @recipe.ingredients.each do |ingredient| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 37]]
---

        <% if @recipe.reviews.blank? %>