app/controllers/profiles_controller.rb

SELECT  "recipes".* FROM "recipes" INNER JOIN "favorite_recipes" ON "recipes"."id" = "favorite_recipes"."recipe_id" WHERE "favorite_recipes"."user_id" = $1  ORDER BY created_at DESC LIMIT 2 OFFSET 0  [["user_id", 3]]
SELECT COUNT(*) FROM "recipes" INNER JOIN "favorite_recipes" ON "recipes"."id" = "favorite_recipes"."recipe_id" WHERE "favorite_recipes"."user_id" = $1  [["user_id", 3]]
---
  def show
    @fullname = current_user.first_name + " " + current_user.last_name
    @recipes = current_user.recipes.page(params[:recipes_page]).order("created_at DESC")