app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE (lower(name) LIKE '%%')  ORDER BY created_at DESC
SELECT COUNT(*) FROM "recipes" WHERE (lower(name) LIKE '%nagerecht%' or lower(course) LIKE '%nagerecht%' or lower(kitchen) LIKE '%nagerecht%')
---
  def index
    if params[:search]
      @recipes = Recipe.search(params[:search]).order('created_at DESC').page(params[:page]).per(8)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 4]]
---
  def show
    @review = Review.new
    @recipe = Recipe.find(params[:id])
    @user = User.find(@recipe.user_id)
    @full_name = @recipe.user.first_name + " " + @recipe.user.last_name
    @reviews = @recipe.reviews.order('created_at DESC').page(params[:page]).per(5)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", nil]]
---
    def find_recipe
      @recipe = Recipe.find(params[:id])