app/views/reviews/_review.html.erb

<% if @recipe.reviews.blank? %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 6]]

        <div class="review-user">
          <p><%= review.user.first_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]

        <div class="review-date">
          <p> <%= review.created_at.strftime('%d/%m/%Y') %> </p>
---
INSERT INTO "reviews" ("content", "rating", "user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"