app/controllers/users/recipes_controller.rb

INSERT INTO "recipes" ("name", "summary", "description", "kitchen", "course", "cooking_time", "prep_time", "photo", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)
    @user = current_user
    @recipe.user = @user
    if @recipe.valid?
      @recipe.save!

UPDATE "recipes" SET "name" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["name", "Nasi met loempia"], ["updated_at", "2016-05-25 15:52:09.605116"], ["id", 7]]
---
  def update
    @recipe.update!(recipe_params)

SELECT "recipes".* FROM "recipes" INNER JOIN "favorite_recipes" ON "recipes"."id" = "favorite_recipes"."recipe_id" WHERE "favorite_recipes"."user_id" = $1  [["user_id", 3]]
---
  def find_recipe
    @recipe = current_user.recipes.find(params[:id])